<?php
function num2str($inn, $stripkop=false)
	{
	$nol = 'нуль';
    $str[100]= array('','сто','дв≥ст≥','триста','чотириста','п\'€тсот','ш≥стсот', 'с≥мсот', 'в≥с≥мсот','дев\'€тсот');
    $str[11] = array('','дес€ть','одинадц€ть','дванадц€ть','тринадц€ть', 'чотирнадц€ть','п\'€тнадц€ть','ш≥стнадц€ть','с≥мнадц€ть', 'в≥с≥мнадц€ть','дев\'€тнадц€ть','двадц€ть');
    $str[10] = array('','дес€ть','двадц€ть','тридц€ть','сорок','п\'€тдес€т', 'ш≥стдес€т','с≥мдес€т','в≥с≥мдес€т','дев\'€носто');
    $sex = array(
    array('','один','два','три','чотири','п\'€ть','ш≥сть','с≥мь', 'в≥с≥м','дев\'€ть'),// m
    array('','одна','дв≥','три','чотири','п\'€ть','ш≥сть','с≥мь', 'в≥с≥м','дев\'€ть') // f
    );

    $forms = array(
    array('коп.', 'коп.', 'коп.', 1), // 10^-2
    array('грн.', 'грн.', 'грн.',  0), // 10^ 0
    array('тис€ча', 'тис€ч≥', 'тис€ч', 1), // 10^ 3
    array('м≥льйон', 'м≥льйона', 'м≥льйон≥в',  0), // 10^ 6
    array('м≥ль€рд', 'м≥льарда', 'м≥ль€рд≥в',  0), // 10^ 9
    array('трилйон', 'трильйона', 'трильйон≥в',  0), // 10^12
	);

    $out = $tmp = array();
    // ѕоехали!
    $tmp = explode('.', str_replace(',','.', $inn));
    $uah = number_format($tmp[ 0], 0,'','-');
    if ($uah== 0) $out[] = $nol;
    // нормализаци€ копеек
    $kop = isset($tmp[1]) ? substr(str_pad($tmp[1], 2, '0', STR_PAD_RIGHT), 0,2) : '00';
    $segments = explode('-', $uah);
    $offset = sizeof($segments);
    if ((int)$uah== 0) { // если 0 рублей
        $o[] = $nol;
        $o[] = morph( 0, $forms[1][ 0],$forms[1][1],$forms[1][2]);
    }
    else {
        foreach ($segments as $k=>$lev) {
            $sexi= (int) $forms[$offset][3]; // определ€ем род
            $ri = (int) $lev; // текущий сегмент
            if ($ri== 0 && $offset>1) {// если сегмент==0 & не последний уровень(там Units)
                $offset--;
                continue;
            }
            // нормализаци€
            $ri = str_pad($ri, 3, '0', STR_PAD_LEFT);
            // получаем циферки дл€ анализа
            $r1 = (int)substr($ri, 0,1); //перва€ цифра
            $r2 = (int)substr($ri,1,1); //втора€
            $r3 = (int)substr($ri,2,1); //треть€
            $r22= (int)$r2.$r3; //втора€ и треть€
            // разгребаем пор€дки
            if ($ri>99) $o[] = $str[100][$r1]; // —отни
            if ($r22>20) {// >20
                $o[] = $str[10][$r2];
                $o[] = $sex[ $sexi ][$r3];
            }
            else { // <=20
                if ($r22>9) $o[] = $str[11][$r22-9]; // 10-20
                elseif($r22> 0) $o[] = $sex[ $sexi ][$r3]; // 1-9
            }
            // –убли
            $o[] = morph($ri, $forms[$offset][ 0],$forms[$offset][1],$forms[$offset][2]);
            $offset--;
        }
    }
    //  опейки
    if (!$stripkop) {
        $o[] = $kop;
        $o[] = morph($kop,$forms[ 0][ 0],$forms[ 0][1],$forms[ 0][2]);
    }
    return preg_replace("/\s{2,}/",' ',implode(' ',$o));
}

//—клон€ем словоформу
function morph($n, $f1, $f2, $f5) {
    $n = abs($n) % 100;
    $n1= $n % 10;
    if ($n>10 && $n<20) return $f5;
    if ($n1>1 && $n1<5) return $f2;
    if ($n1==1) return $f1;
    return $f5;
}
?> 